app/views/static/index.html.erb

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
        <div class="col-6 p-3 mb-3 d-flex justify-content-between bg-light text-dark center-block border">
          <%=Gossip.all[nb].title%>
          <p class="m-0"><%=Gossip.all[nb].user.first_name%> <%=Gossip.all[nb].user.last_name%>  <a href="/gossips/<%=nb%>"> Voir plus</a></p>

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <div class="col-6 p-3 mb-3 bg-dark text-white d-flex justify-content-between">
          <%=Gossip.all[nb].title%>
          <p class="m-0"><%=Gossip.all[nb].user.first_name%> <%=Gossip.all[nb].user.last_name%>  <a href="/gossips/<%=nb%>"> Voir plus</a></p>