app/views/dynamic/index.html.erb

<%
if Gossip.all.size - params[:id].to_i*11 < 11
most = Gossip.all.size - params[:id].to_i*11
---
SELECT "gossips".* FROM "gossips"
SELECT COUNT(*) FROM "gossips"

        <div class="col-6 p-3 mb-3 d-flex justify-content-between bg-light text-dark center-block border">
          <%=Gossip.all[nb + params[:id].to_i*11].title%>
          <p class="m-0"><%=Gossip.all[nb+ params[:id].to_i*11].user.first_name%> <%=Gossip.all[nb+ params[:id].to_i*11].user.last_name%>  <a href="/gossips/<%=nb+ params[:id].to_i*11%>"> Voir plus</a></p>
---
SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    <div class="col-6 p-3 mb-3 bg-dark text-white d-flex justify-content-between">
      <%=Gossip.all[nb + params[:id].to_i*11].title%>
      <p class="m-0"><%=Gossip.all[nb+ params[:id].to_i*11].user.first_name%> <%=Gossip.all[nb+ params[:id].to_i*11].user.last_name%>  <a href="/gossips/<%=nb+ params[:id].to_i*11%>"> Voir plus</a></p>
---
SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]