app/views/dynamic/index_gossip.html.erb

                <li><i class="fas fa-map-marker-alt fa-2x"></i>
                    <p>Le titre de ce gossip est <%=Gossip.all[params[:number].to_i].title%> </p>
---
SELECT "gossips".* FROM "gossips"

                <li><i class="fas fa-phone mt-4 fa-2x"></i>
                    <p>Voici le contenue du gossip : <%=Gossip.all[params[:number].to_i].content%></p>
---
SELECT "gossips".* FROM "gossips"

                <li><i class="fas fa-envelope mt-4 fa-2x bd"></i>
                    <p>l'auteur de gossip est <%=Gossip.all[params[:number].to_i].user.first_name%> <%=Gossip.all[params[:number].to_i].user.last_name%> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"